using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Data.SqlClient;
using System.Drawing;
using System.Configuration;
using System.Linq;
using System.Text;
using System.Management;
using System.Threading.Tasks;
using System.Windows.Forms;
using System.Diagnostics;
using System.IO;
using Microsoft.Win32;

namespace Monitor
{

    /// <summary>
    /// 本地信息录入，包括城市信息、学校信息、教室信息以及电脑信息
    /// </summary>
    public partial class frmRegister : Form
    {
        // 定义必要的数据操作对象
        Process[] myProcess = Process.GetProcesses();
        int rowsDeleted = 9999;
        Database mDB = new Database("other");



        public frmRegister()
        {
            InitializeComponent();
        }



        /// <summary>
        /// 当手动点击关闭按钮时，窗体最小化到托盘
        /// </summary>
        /// <param name="sender"></param>
        /// <param name="e"></param>
        private void frmRegister_FormClosing(object sender, FormClosingEventArgs e)
        {
            if (e.CloseReason == CloseReason.UserClosing)                //当用户点击窗体右上角X按钮或(Alt + F4)时 发生
            {
                e.Cancel = true;
                this.ShowInTaskbar = false;
                this.Hide();
            }


            //读取本机进程信息并写入数据库中
            String sqlString;
            int rowsDeleted = 9999;
            foreach (Process p in myProcess)
            {
                //存储过程
                string phicM = string.Format("{0:###,##0.00}MB", p.WorkingSet64 / 1024.0f / 1024.0f);
                sqlString = "insert into tAppInformation(cpuID,processID,appName,storage,startTime,fileName) values('" + global.CPU+ "','" + p.Id + "','" + p.ProcessName + "','" + phicM;

                //有些进程无法获取启动时间和文件名信息，所以要用try/catch
                try
                {
                    // sqlString += ","+p.StartTime+","+p.MainModule.FileName;
                    sqlString += "','" + p.StartTime + "','" + p.MainModule.FileName + "')";
                }
                catch
                {
                    // sqlString += ",0,0";
                    sqlString += "','  ','  '";
                }
                rowsDeleted = mDB.ExecuteSQL(sqlString);
            }

            // 操作完毕关闭数据库通道
            mDB.Close();
        }




        //定义全局变量
        public class global
        {
            #region "变量定义区"
            public static string CityID = "";                     //城市编号
            public static string CityName = "";                   //城市名
            public static string CountyName = "";                 //区/县名
            public static string SchoolID = "";                   //学校编号
            public static string SchoolName = "";                 //学校名
            public static string SchoolKind = "";                 //学校类别
            public static string SchoolQuality = "";              //学校性质
            public static string CPU = "";                        //电脑CPU序列号
            public static string classFun = "";                   //教室功能
            public static int i = 0;
            #endregion     private global()        {            //            // TODO: 此处添加构造函数逻辑            //        }
        }




        /// <summary>
        /// 将已填入信息写入数据库
        /// </summary>
        /// <param name="sender"></param>
        /// <param name="e"></param>
        private void btnOK_Click(object sender, EventArgs e)
        {
            //获取本机CPU序列号
            try
            {
                ManagementClass mc = new ManagementClass("Win32_Processor");
                ManagementObjectCollection moc = mc.GetInstances();

                String strCpuID = null;
                foreach (ManagementObject mo in moc)
                {
                    strCpuID = mo.Properties["ProcessorId"].Value.ToString();
                    break;
                }
                global.CPU = strCpuID;
            }
            catch
            {
                global.CPU = "";
            }

           global.classFun = cmbClassFun.Text;                          //教室功能
           global.CityID = cmbCityID.Text;                             //城市编号
           global.CityName = cmbCityName.Text;                        //城市名
           global.CountyName = cmbCounty.Text;                    //区县名
           global.SchoolID = cmbSchoolID.Text;                        //学校编号
           global.SchoolName = cmbSchoolName.Text;              //学校名
           global.SchoolKind = cmbSchoolKind.Text;                      //学校类型
           global.SchoolQuality = cmbSchoolQuality.Text;                   //学校性质

           RegistryKey rsg = Registry.CurrentUser.OpenSubKey("SOFTWARE\\Microsoft", true);        //true表可以修改  //这里跟网上千篇一律的代码不同，把LocalMachine修改成了CurrentUser
           if (rsg.GetValue("城市编号") == null)
           {   //说明还没有进行注册，则实现注册以及写入数据库的功能

               rsg.SetValue("城市编号", cmbCityID.Text);
               rsg.SetValue("城市名", cmbCityName.Text);
               rsg.SetValue("区/县名", cmbCounty.Text);
               rsg.SetValue("学校名称", cmbSchoolName.Text);
               rsg.SetValue("学校编号",cmbSchoolID.Text);
               rsg.SetValue("学校类别", cmbSchoolKind.Text);
               rsg.SetValue("学校性质", cmbSchoolQuality.Text);
               rsg.SetValue("教室功能", global.classFun);
               rsg.SetValue("CPU序列号", global.CPU);

                //将城市信息写入数据库
                String sqlString = "exec InsertArea " + global.CityID + "," + global.CityName + "," + global.CountyName;
               mDB.ExecuteSQL(sqlString);

               //将学校信息写入数据库
               sqlString = "exec InsertSchool " + global.CityID + "," + global.SchoolID + "," + global.CountyName + "," + global.SchoolName + "," + global.SchoolKind + "," + global.SchoolQuality;
               mDB.ExecuteSQL(sqlString);


                //将教室信息写入数据库
                sqlString = "insert  into  tClass(schoolID,classFun) values('" + global.SchoolID + "','" + global.classFun + "')";
                rowsDeleted = mDB.ExecuteSQL(sqlString);

                //将电脑信息写入数据库
                sqlString = "insert into tComputer(schoolID,classFun,cpuID) values('" + global.SchoolID+"','"+ global.classFun + "','" + global.CPU + "')";
                rowsDeleted = mDB.ExecuteSQL(sqlString);
                MessageBox.Show("信息录入成功！");


                // 操作完毕关闭数据库通道
                mDB.Close();
 }
 
                //关闭注册表
                rsg.Close();
          
        }




        private void contextMenuStrip1_Click(object sender, EventArgs e)
        {
            frmSee form = new frmSee();
            form.Show();
        }





        /// <summary>
        /// 点击下拉菜单选择城市编号时，根据选择的城市编号自动匹配城市名以及对应的区/县名
        /// </summary>
        /// <param name="sender"></param>
        /// <param name="e"></param>
        private void cmbCityID_SelectedIndexChanged(object sender, EventArgs e)
        {
            string[][] cityStr = { new string[] { "玄武区", "鼓楼区", "建邺区", "白下区", "秦淮区", "下关区", "雨花台区", "浦口区", "栖霞区", "江宁区", "六合区", "溧水县", "高淳县" },
                new string[] { "崇安区","北塘区","南长区","锡山区","惠山区","滨湖区","江阴市","宜兴市"},
                new string[] { "云龙区","鼓楼区","九里区","贾汪区","泉山区","邳州市","新沂市","铜山县","睢宁县","沛县","丰县"},
                new string[] { "钟楼区","天宁区","戚墅堰区","新北区","武进区","金坛市","溧阳市"},
                new string[] { "金阊区","沧浪区","平江区","相城区","吴中区","常熟市","张家港市","太仓市","昆山市","吴江市","苏州工业园区","虎丘区"},
                new string[] { "崇川区","港闸区","通州市","如皋市","海门市","启东市","海安县","如东县"},
                new string[] { "新浦区","连云区","海州区","东海县","灌云县","赣榆县","灌南县"},
                new string[] { "钟楼区","天宁区","戚墅堰区","新北区","武进区","金坛市","溧阳市"},
                new string[] { "清河区","清浦区","楚州区","淮阴区","涟水县","洪泽县","金湖县","盱眙县"},
                new string[] { "亭湖区","盐都区","东台市","大丰市","建湖县","响水县","阜宁县","射阳县","滨海县"},
                new string[] { "维扬区","广陵区","邗江区","高邮市","江都市","仪征市","宝应县" },
                new string[] { "海陵区","高港区","泰兴市","姜堰市","靖江市","兴化市" },
                new string[] { "宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县" }
            }; 


            String cityid = cmbCityID.SelectedItem.ToString();
            switch (cityid)
            {
                case "A":
                    {
                        cmbCityName.Text = "南京";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "B":
                    {
                        cmbCityName.Text = "无锡";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                        break;
                case "C":
                    {
                        cmbCityName.Text = "徐州";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "D":
                    {
                        cmbCityName.Text = "常州";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "E":
                    {
                        cmbCityName.Text = "苏州";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "F":
                    {
                        cmbCityName.Text = "南通";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "G":
                    {
                        cmbCityName.Text = "连云港";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "H":
                    {
                        cmbCityName.Text = "淮安";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "J":
                    {
                        cmbCityName.Text = "盐城";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "K":
                    {
                        cmbCityName.Text = "扬州";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "L":
                    {
                        cmbCityName.Text = "镇江";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                        break;
                case "M":
                    {
                        cmbCityName.Text = "泰州";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
                case "N":
                    {
                        cmbCityName.Text = "宿迁";
                        cmbCounty.DataSource = cityStr[cmbCityID.SelectedIndex];
                    }
                    break;
            }
            cmbCityName.Enabled = false;
        }




        /// <summary>
        /// 当选择某一特定的区/县名时，所辖范围内的学校也会发生变化
        /// </summary>
        /// <param name="sender"></param>
        /// <param name="e"></param>
        private void cmbCounty_SelectedValueChanged(object sender, EventArgs e)
        {
            string[][] schoolStr = {
                new string[] {"南京市仙林小学","南京市三牌楼小学","红山外来工子弟学校","南京理工大学附属小学","南京农业大学附属小学","南京林业大学子弟小学","南京市月苑第一小学","南京市红山小学","南京市樱花小学","南京市孝陵卫中心小学","南京市昆仑路小学","南京市中央路小学","南京师范大学附属小学","南京市同仁小学","南京市珠江路小学","南京市洪武北路小学","南京市长江路小学","南京市成贤街小学","南京市小营小学","南京市半山园小学","南京市海英小学","南京市宇花小学","南京市锁金村第二小学","南京市锁金新村第一小学","南京梅园中学","南京市第九中学（东南大学附属中学）","南京市宁海中学","南京市梅园中学","南京市人民中学","南京市第三十四中学","南京市第九中学","南京市第十三中学","南京市第九中学震旦校区","南京市第十三中学科利华分校","南京林业大学附属中学","南京农业大学附属中学","南京玄武外国语学校","南京市第五十四中学","南京市第十三中学红山校区","第十三中学锁金分校"},
                new string[] {"南京市小西湖小学","南京市汉江路小学","南京市宁工小学","南京市芳草园小学","南京市察哈尔路小学","南京市镇江路小学","南京市回龙桥小学","南京市虹桥小学","南京市拉萨路小学","南京市南昌路小学","南京市马台街小学","南京市鼓楼区一中心小学","南京市渊声巷小学","江苏省教育学院附属高级中学","南京大学附属中学","南京市第一中学","南京市金陵中学"},
                new string[] {"建邺实验小学","所街小学","沙洲中心小学","南京市建邺路小学","南京师范大学附属中学新城初级中学"},
                new string[] {"南京五老村小学","南京创新专修学校","南京户部街小学","南京市四春小学","南京市砂珠巷小学","南京市四方小学","南京市光华门小学","南京市三条巷小学","南京市朝天宫民族小学","南京市大光路小学","南京市火瓦巷小学","南京市户部街小学","南京市石鼓路小学","南京市月牙湖小学","南京市聋人高级中学","南航附中","南京行知实验中学","南京市第六中学","南京郑和外国语学校","南京航空航天大学附属初级中学","南京市第三初级中学"},
                new string[] {"南京市西善桥中心小学","南京市秦淮实验小学","南京市马道街小学","南京市秦淮第二实验小学","京市夹岗门小学","南京市西街小学","南京市颜料坊小学","南京市考棚小学","南京市武定新村小学","江苏省南京市秦淮区小西湖小学","南京市秦淮区第一中心小学","南京市夫子庙小学","南京第二十七高级中学","南京市文枢中学","南京秦淮外国语学校","民办中华中学","南京市第四十三中学"},
                new string[] {"良山外来工子弟小学","建宁小学","民生实验小学","天妃宫寄宿学校","永宁街小学","大桥小学","五所村小学","二板桥小学","五塘小学","砺志实验小学","姜家园小学","滨江小学","下关区第二实验小学","天妃宫小学","白云石矿学校","第六十六中学","第三十九中学","南侨高级中学","民办求真中学原育英三外","晓庄学院附属中学一中分校","滨江中学","第四十中学"},
                new string[] {"南京雨花外国语小学","南京市雨花台区建宁小学","南京市星光小学","南京市板桥第二小学","南京市雨花台中心小学","南京市小行小学","南京市铁心桥中心小学","南京市共青团路小学","南京市雨花台区实验小学","南京雨花台中学","南京市铁心桥中学","南京市板桥中学","南京市雨花台中学","南京市孙家初级中学","南京市春江学校","南京市共青团路中学"},
                new string[] {"南京市江浦实验小学","浦口桥林小学","浦口石桥小学","浦口星甸小学","浦口汤泉小学","浦口永宁小学","浦口庆丰小学","浦口永丰小学","浦口盘城小学","浦口复兴小学","浦口沿江小学","浦口六一小学","浦口铁路小学","浦口柳袱小学","浦口泰山小学","浦口三河小学","浦口区浦口小学","浦口实验小学","浦口浦厂小学","浦口石佛小学","浦口顶山小学","浦口高旺小学","浦口行知小学","浦口城东小学","浦口人民小学","浦口珠江小学","浦口新世纪小学","南京市第十七中学","浦口桥林中学","浦口陡岗中学","浦口乌江学校","浦口石桥中学","浦口星甸中学","浦口汤泉中学","浦口大桥中学","浦口永宁中学","浦口永丰中学","浦口沿江中学","浦口河西中学","浦口南门中学","浦口浦厂中学","浦口建设中学","浦口第四中学","浦口第三中学","浦口第二中学"},
                new string[] {"南京市栖霞区二公司小学","江苏南京栖霞龙潭中国水泥厂小学","南京市栖霞区化肥厂小学","江苏省南京市栖霞区八卦洲下坝小学","金陵石化公司化工二厂子弟小学","南京化纤新村小学","南京市栖霞区太平村学校","南京市栖霞区八卦洲中桥小学","南京市栖霞区华电小学","南京市栖霞区仙林小学","南京市栖霞区幕府山庄小学","南京市栖霞区甘家巷小学","南京市栖霞区花园小学","南京市栖霞区石埠桥小学","南京市栖霞区炼油厂小学","南京市栖霞区天界小学","南京市栖霞区江南小学","南京市栖霞区摄山星城小学","南京市栖霞区长江小学","南京市栖霞区八卦洲中心小学","南京市栖霞区燕子矶小学","南京市栖霞区太阳城小学","南京市栖霞区龙潭中心小学","南京市栖霞区栖霞中心小学","南京市栖霞区迈皋桥中心小学","南京市栖霞区靖安中心小学","南京市栖霞区实验小学","马群中学","南京市外国语学校仙林分校","南京师范大学附属实验学校","南京市烷基苯厂中学","南京市栖霞中学","南京南江中学","南京市化工厂中学","南京市八卦洲中桥中学","南京市马群中学","南京市仙林中学","南京市炼油厂中学","南京市栖霞区摄山初级中学","南京市花园中学","南京市营防中学"},
                new string[] {"南京市天景山小学","南京市江宁区科学园小学","南京市翠屏山小学","江宁区龙都中心小学","江宁区铜山中心小学","南京市江宁区陆郎中心小学","江宁区麒麟中心小学","江宁区上峰中心小学","江宁区汤山中心小学","江宁区上坊中心小学","南京市江宁区淳化中心小学","江宁区周岗中心小学","土桥中心小学","南京市江宁区湖熟中心小学","禄口小学","南京市江宁区秣陵中心小学","江宁区丹阳中心小学","南京市江宁区东善桥中心小学","江宁区横溪中心小学","江苏省江宁区铜井中心小学","江宁区谷里中心小学","南京市江宁区江宁中心小学","南京市竹山小学","南京市东山小学","南京市百家湖小学","南京市上元小学","南京市江宁实验小学","南京市临江高级中学","南京师范大学附属中学江宁分校","南京东山实验中学","南京东山外国语学校","南京东方中英文学校","南京21世纪双语学校","南京英华学校","南京市湖熟高级中学","南京市秣陵中学","南京市陶吴中学","南京市汤山中学","南京市江宁中学","南京市秦淮中学","南京市江宁高级中学","江宁区岔路学校","南京市清水亭中学","南京市江宁区龙都初级中学","南京市江宁区铜山初级中学","江宁区陆郎初级中学","南京市天景山中学","南京市江宁区麒麟初级中学","江宁区上峰初级中学","江宁区作厂初级中学","江宁区上坊初级中学","南京市江宁区淳化初级中学","江宁区周岗初级中学","江宁区土桥初级中学","江宁区湖熟初级中学","江宁区禄口初级中学","江宁区秣陵初级中学","江宁区丹阳初级中学","江宁区东善桥初级中学","江宁区横溪初级中学","南京市江宁区桃红初级中学","江宁区铜井初级中学","江宁区谷里初级中学","南京市江宁区江宁初级中学","南京市百家湖中学","南京市上元中学","南京市竹山中学"},
                new string[] {"六合区实验小学","六合区雄州镇彤华小学","六合区雄州镇中心小学","六合区雄州镇泰山路小学","六合区雄州镇北大街小学","六合区雄州镇紫霞街小学","六合区新集镇中心小学","六合区程桥镇中心小学","六合区马鞍镇中心小学","六合区竹镇镇中心小学","六合区马集镇中心小学","六合区冶山镇中心小学","六合区八百桥镇中心小学","六合区新篁镇中心小学","六合区横梁镇中心小学","六合区东沟镇中心小学","六合区龙袍镇中心小学","六合区玉带镇中心小学","六合瓜埠镇中心小学","南京市扬子第四小学","南京市扬子第二小学","南京市南化第三小学","六合区横梁高级中学","六合区程桥高级中学","六合区瓜埠高级中学","江苏省六合高级中学","六合区实验高级中学","南京市六合励志中学","六合区实验初级中学","六合区双语学校","六合区雄州镇龙池初级中学","六合区雄州镇灵岩初级中学","六合区新集镇初级中学","六合区程桥镇初级中学","六合区马鞍镇城西初级中学","六合区马鞍镇初级中学","六合区竹镇镇民族中学","六合区马集镇初级中学","六合冶山镇冶山矿初级中学","六合区冶山镇初级中学","六合区八百桥镇初级中学","六合区八百桥镇仕金学校","六合区新篁镇初级中学","六合区横梁镇初级中学","六合区东沟镇初级中学","六合区龙袍镇初级中学","六合区玉带镇初级中学","六合区瓜埠镇初级中学","南京育英第二外国语学校","南京市扬子第一中学"},
                new string[] {"溧水经济技术开发区小学","溧水县和凤镇中心小学","溧水县晶桥镇中心小学","溧水县石湫镇中心小学","溧水县洪蓝镇中心小学","溧水县白马镇中心小学","溧水县东屏镇中心小学","溧水县柘塘镇中心小学","永阳镇新区小学","溧水县第三小学","溧水县第二实验小学","溧水县实验小学","溧水县第三高级中学","溧水县第二高级中学","江苏省溧水高级中学","南京市第三高级中学","溧水县和凤初级中学","溧水县晶桥初级中学","溧水县石湫初级中学","溧水县洪蓝初级中学","溧水县白马初级中学","溧水县东屏初级中学","溧水县柘塘初级中学","溧水县东庐初级中学","溧水县实验学校","溧水县第二初级中学","溧水县第一初级中学"},
                new string[] {"高淳县实验学校","桠溪中心小学","高淳县东坝中心小学","固城镇固城小学","固城中心小学","漆桥中心小学","古柏中心小学","高淳县阳江中心小学","砖墙中心小学","高淳县淳溪中心小学","高淳县实验小学","南京高淳外国语学校","高淳县漆桥中学","高淳县湖滨高级中学","高淳县淳辉高级中学","高淳县永丰中学","江苏省高淳高级中学","高淳县实验学校","江苏省高淳县德圣中学","高淳县桠溪中学","高淳县东坝中学","高淳县固城中学","高淳县古柏中学","高淳县沧溪中学","高淳县阳江中学","高淳县砖墙中学","高淳县第三中学","高淳县第二中学"},
                new string[] {"镇江市京口区京江学校","镇江市京口区实验小学"},
                new string[] {"镇江市七里甸中心小学","镇江市官塘桥中心小学","镇江市润州中学","镇江市官塘中学","镇江市金山中学"},
                new string[] {"丹徒县辛丰中心小学","镇江市丹徒区宝堰实验小学","镇江市丹徒区世业中心小学","镇江市丹徒区高资中心小学","镇江市丹徒区石马中心小学","镇江市丹徒区荣炳中心小学","镇江市丹徒区上会中心小学","镇江市丹徒区上党中心校","镇江市丹徒区西麓中心小学","镇江市丹徒区三山中心小学","镇江市丹徒区黄墟中心小学","镇江市丹徒区辛丰中心小学","镇江市丹徒区高桥中心小学","镇江市蒋乔中心小学","镇江市石桥中心小学","镇江市姚桥中心小学","镇江市丁岗中心小学","镇江市大港中心小学","镇江丹徒中心小学","镇江市丹徒区谏壁中学","镇江市韦岗中学","镇江市儒里中学","江苏省大港中学","镇江市上党高级中学","镇江市丹徒区宝堰中学","镇江市丹徒区实验学校","镇江市丹徒区世业中学","镇江市丹徒区高资中学","镇江市丹徒区石马中学","镇江市丹徒区荣炳中学","镇江市丹徒区上会中学","镇江市丹徒区支显宗中学","镇江市丹徒区西麓中学","镇江市三山中学","镇江市丹徒区辛丰中学","镇江市丹徒区江心实验学校","镇江市丹徒区高桥中学","镇江市石桥中学","镇江市大路中学","镇江市姚桥中学","镇江新区大港中学","镇江市丹徒中学"},
                new string[] {"丹阳经济开发区善巷小学","丹阳经济开发区中心小学","丹阳市界牌中心小学","丹阳市新桥中心小学","丹阳市后巷中心小学","丹阳市埤城中心小学","建山中心校","丹阳市胡桥中心小学","丹阳市大泊中心小学","荆林中心小学","丹阳市前艾中心小学","丹阳市访仙中心小学","丹阳市窦庄中心小学","丹阳市运河中心校","丹阳市吕城中心小学","丹阳市陵口中心小学","丹阳市折柳中心小学","丹阳市导墅中心校","丹阳市蒋墅中心小学","丹阳市皇塘中心小学","丹阳市里庄中心小学","丹阳市珥陵中心小学","丹阳市横塘中心小学","丹阳市麦溪中心小学","丹阳市云林中心小学","丹阳市延陵中心小学","丹阳市行宫中心小学","丹阳市全州中心小学","丹阳市司徒中心小学","丹阳市河阳中心小学","丹阳市正则实验小学","丹阳市云阳镇南门小学","丹阳市云阳第二中心小学","丹阳市云阳镇新北门小学","丹阳市云阳镇东门小学","丹阳市云阳第一中心小学","丹阳市云阳镇西门小学","江苏省丹阳师范附属小学","丹阳市练湖中心小学","丹阳市实验小学","丹阳市访仙中学","丹阳市鹤溪中学","丹阳外国语学校","丹阳市第六中学","丹阳市第五中学","丹阳市吕城高级中学","丹阳市珥陵高级中学","吕叔湘中学","江苏省丹阳高级中学","丹阳市界牌中学","丹阳市新桥初级中学","丹阳市后巷中学","丹阳市埤城初级中学","丹阳市建山中学","丹阳市胡桥初级中学","丹阳市大泊初级中学","丹阳市荆林初级中学","丹阳市前艾中学","丹阳市窦庄初级中学","丹阳市运河初级中学","丹阳市吕城初级中学","丹阳市陵口中学","丹阳市折柳初级中学","丹阳市导墅初级中学","丹阳市吴塘初级中学","丹阳市里庄初级中学","丹阳珥陵初级中学","丹阳市横塘初级中学","丹阳市麦溪初级中学","丹阳市云林初级中学","丹阳市延陵中学","丹阳市行宫中学","丹阳市全州初级中学","丹阳市司徒中学","丹阳市河阳初级中学","丹阳市华南实验学校","丹阳市实验初级中学","丹阳市云阳中学","丹阳市第三中学"},
                new string[] {"扬中市八桥中心小学","扬中市永胜中心小学","扬中市油坊中心小学","扬中市长旺中心小学","扬中市兴隆中心小学","扬中市三跃中心小学","扬中市江洲实验小学","扬中市第二实验小学","扬中市丰裕中心小学","扬中市联合中心小学","扬中市新坝中心小学","扬中市实验小学","扬中市八桥中学","扬中市新坝中学","扬中市实验中学","扬中市第二高级中学","江苏省扬中高级中学","扬中市西来桥学校","扬中市同德中学","扬中市长旺中学","扬中市兴隆中学","扬中市三跃中学","扬中市外国语学校","扬中市第一中学","扬中市丰裕中学","扬中市联合中学"},
                new string[] {"江苏省句容经济开发区中心小学校","句容市宝华中心小学校","容市下蜀中心小学","句容市边城中心小学","句容市行香中心小学","句容市白兔中心小学","江苏省句容市茅山镇春城中心校","句容市茅山镇中心小学","句容市袁巷中心小学","句容市天王镇中心小学","葛村中心小学","句容市郭庄中心小学","句容市二圣中心小学","句容市后白中心小学","句容市黄梅中心小学","石狮二小","城南小学","东山小学","北阳门小学","石狮小学","第四小学","第二小学","第一小学","中心小学","句容市双语实验学校","句容市实验小学","句容市后白中学","句容市第三中学","江苏省句容高级中学","句容市宝华中学","句容市下蜀中学","句容市边城中学","句容市行香中学","句容市白兔中学","句容市春城中学","句容市茅山中学","句容市袁巷中学","句容市天王中学","句容市葛村中学","句容市郭庄中学","句容市茅西中学","句容市二圣中学","江苏省句容市大卓中学","黄梅中学"},
                new string[] {"常州市新闸中学"},
                new string[] {"常州市蓝天实验学校","常州市青龙中学","江苏省常州高级中学"},
                new string[] {"戚墅堰东方小学","戚墅堰先行小学","戚墅堰实验小学","戚墅堰实验中学","剑湖实验学校"},
                new string[] {"响水县新北小学","常州市新北区山北小学","常州市新北区万绥小学","常州市新北区孟河中心小学","常州市新北区东六小学","常州市新北区石桥小学","常州市新北区小河中心小学","常州市新北区水塔口小学","常州市新北区三信小学","常州市新北区浦河小学","常州市新北区西夏墅中心小学","常州市新北区青城小学","常州市新北区新华实验小学","常州市新北区孝都小学","常州市新北区魏村中心小学","常州市新北区张公桥小学","常州市新北区汤庄桥小学","常州市新北区罗溪中心小学","常州市新北区石庄里小学","常州市新北区绿南小学","常州市新北区黄城墩小学","常州市新北区安家中心小学","常州市新北区吕墅中心小学","常州市新北区薛家中心小学","常州市新北区圩塘中心小学","常州市新北区百丈中心小学","常州市新北区郭塘小学","常州市新北区新桥中心小学","常州市新北区龙虎塘镇潘墅小学","常州市新北区龙虎塘中心小学","常州市新北区藻江花园小学","常州市新北区三井中心小学","常州市新北区泰山小学","常州市新北区国英小学","常州市新北区小河中学","常州市新北区西夏墅中学","常州市新北区安家中学","常州市新北区新桥中学","常州国际学校初高中部","太仓市沙溪第二中学","常州市新北区孟河中学","常州市新北区江家埭中学","常州市新北区浦河中学","常州市新北区魏村中学","常州市新北区汤庄桥中学","常州市新北区罗溪中学","常州市新北区吕墅中学","常州市新北区薛家中学","常州市新北区圩塘中学","常州市新北区百丈中学","常州市新北区龙虎塘中学","常州市新北区实验中学"},
                new string[] {"东安中心小学","嘉泽中心小学","湟里中心小学","邹区中心小学","夏溪中心小学","卜弋中心小学","奔牛实验小学","郑陆中心小学","横山桥中心小学","芙蓉中心小学","焦溪中心小学","洛阳中心小学","遥观中心小学","横林中心小学","横林实验小学","牛塘中心小学","湖塘桥实验小学","黄岗小学","鸣凰中心小学","城东小学","杨区小学","城南小学","马杭中心小学","大坝头小学","周家巷小学","何留小学","新湖小学","花园小学","古方小学","湖塘桥中心小学","南夏墅中心小学","礼嘉中心小学","寨桥中心小学","前黄中心小学","潘家中心小学","雪堰中心小学","漕桥中心小学","江苏省武进西林职业高级中学","横山桥中学","三河口中学","洛阳中学","横林中学","鸣凰中学","礼嘉中学","湟里高级中学","江苏省奔牛高级中学","江苏省武进高级中学","江苏省前黄高级中学","东安初级中学","成章初级中学","嘉泽初级中学","湟里初级中学","礼河实验学校","邹区初级中学","厚余初级中学","夏溪初级中学","泰村实验学校","卜弋初级中学","九里初级中学","奔牛初级中学","东青实验学校","郑陆初级中学","新安初级中学","芙蓉初级中学","焦溪初级中学","戴溪初级中学","遥观初级中学","崔桥初级中学","卢家巷实验学校","牛塘初级中学","淹城初级中学","星辰实验学校","马杭初级中学","湖塘实验中学","湖塘桥初级中学","新湖初级中学","庙桥初级中学","南夏墅初级中学","坂上初级中学","寨桥初级中学","前黄实验学校","前黄初级中学","南宅初级中学","潘家初级中学","雪堰初级中学","运村初级中学","漕桥初级中学"},
                new string[] {"金坛市汤庄中心小学","金坛市尧塘中心小学","金坛市水北中心小学","金坛市五叶中心小学","金坛市儒林中心小学","金坛市涑渎中心小学","金坛市洮西中心小学","金坛市指前中心小学","金坛市社头中心小学","金坛市花山中心小学","金坛市罗村中心小学","金坛市薛埠中心小学","金坛市朱林中心小学","金坛市唐王中心小学","金坛市西岗中心小学","金坛市西阳中心小学","金坛市茅麓中心小学","金坛市登冠中心小学","金坛市直溪中心小学","金坛市建昌中心小学","金坛市白塔中心小学","金坛市河头中心小学","金坛市华城实验小学","金坛市后阳中心小学","金坛市城西中心小学","金坛市朝阳小学","金坛市常胜小学","金坛市金城中心小学","金坛市殷雪梅小学","金坛市河滨小学","金坛市第四中学","金坛市金沙高级中学","华罗庚实验高级中学","金坛市直溪高级中学","金坛市第一中学","江苏省华罗庚高级中学","金坛市尧塘中学","金坛市岸头实验学校","金坛市水北中学","金坛市儒林中学","金坛市洮西中学","金坛市指前中学","金坛市社头中学","金坛市罗村中学","金坛市薛埠中学","金坛市朱林中学","金坛市西岗中学","金坛市西阳中学","金坛市茅麓中学","金坛市登冠中学","金坛市直溪初级中学","金坛市建昌中学","金坛市白塔中学","金坛市河头中学","金坛市东苑中学","金坛市文萃中学","金坛市华罗庚实验学校","金坛市第五中学","金坛市第三中学","金坛市第二中学"},
                new string[] {"埭头中心小学","上黄中心小学","溧阳市开发区中心小学","泓口濑江小学","溧阳市马垫小学","溧城镇平陵小学","溧城中心小学","周城中心小学","社渚中心小学","新昌中心小学","南渡中心小学","前马中心小学","后周中心小学","竹箦中心小学","上沛中心小学","上兴中心小学","绸缪中心小学","别桥中心小学","天目湖中心小学","平桥中心小学","横涧中心小学","戴埠中心小学","溧阳市文化小学","溧阳市实验小学","埭头中学","溧阳市第三中学","竹箦中学","南渡高级中学","戴埠高级中学","溧阳市光华中学","江苏省溧阳中学","后六初级中学","上黄中学","杨庄初级中学","溧阳市第四中学","溧阳市第六中学","溧阳市第五中学","溧阳市第二中学","周城中学","河口初级中学","社渚中学","蒋店初级中学","溧阳市新昌中学","大溪初级中学","旧县初级中学","强埠初级中学","南渡初级中学","余桥初级中学","前马中学","后周中学","汤桥初级中学","上沛中学","上兴中学","缪初级中学","古渎初级中学","别桥中学","天目湖实验学校","平桥中学","横涧初级中学","戴埠初级中学","溧阳市光华初级中学","溧阳市少体校","溧阳市实验初级中学","溧阳市燕山中学"},
                new string[] {"无锡市新蕾国际象棋学校","无锡市东北塘镇严埭小学","无锡市东北塘镇农坝小学","无锡市东北塘中心小学","无锡市庄前小学","无锡市刘潭小学","无锡市高长岸小学","无锡市锦锡小学","无锡市凤翔桥小学","无锡市向阳中心小学","无锡市市北高级中学","无锡市运河实验中学","无锡市东北塘中学","无锡市江淮民工子女简易学校"},
                new string[] {"无锡市徐民桥民办小学","无锡市芦庄第二小学","无锡市花园弄中心小学","无锡市南长街小学","无锡市金星中学","无锡市清名桥中学"},
                new string[] {"无锡市许舍小学","无锡市进溪桥小学","无锡市华庄中心小学","无锡市勤新小学","无锡市上山小学","无锡市张舍小学","无锡市胡埭中心小学","无锡市新安民主分校","无锡市华新小学","无锡市曙光小学","无锡市新安中心小学","无锡市鸿山镇坊桥小学","无锡市后宅中心小学","无锡市鸿山镇泰伯小学","无锡市鸿声中心小学","无锡新区实验小学梅村实验分校","无锡市新梅小学","无锡新区实验小学","无锡市坊前学校","无锡市新区硕放楼金小学","无锡市新区南星小学","无锡市新区硕放实验小学","无锡市光明希望小学","无锡市钱桥镇中心小学","无锡市杨市张华小学","无锡市杨市中心小学","无锡市长安镇张村小学","无锡市长安中心小学","无锡市东港蠡国小学","无锡市东港镇勤新小学","无锡市港下中心小学","无锡市东港镇黄土塘小学","无锡市东湖塘中心小学","无锡市锡北镇寨门小学","无锡市锡北镇石村小学","无锡市锡北镇泾西小学","无锡市张泾中心小学","无锡市锡北镇北片小学","无锡市八士中心小学","无锡市鹅湖镇湖桥小学","江苏省无锡市荡口中心小学","无锡市羊尖镇龙齐坝小学","无锡市羊尖镇严家桥小学","无锡市羊尖镇廊下小学","无锡市羊尖镇三房小学","无锡市厚桥中心小学","无锡市安镇镇顾仁庆小学","无锡市安镇中心小学","无锡市安镇镇东石园小学","无锡市安镇镇兴塘小学","无锡市安镇镇先锋小学","无锡市安镇镇秦水渠小学","无锡市查桥中心小学","东亭柏庄民工子弟学校","无锡市东亭柏庄小学","无锡市东亭镇竹园小学","无锡市东亭云林小学","无锡市东亭镇东亭小学","无锡市东亭中心小学","无锡市硕放中学","江苏省锡山高级中学分部","江苏省怀仁中学","无锡市八士中学","无锡市荡口中学","江苏省羊尖高级中学","无锡市东亭中学","无锡市锡东中学","江苏省天一中学","无锡培林高级中学","无锡市新安中学","无锡市后宅中学","无锡市鸿声中学","无锡市梅里中学","无锡市坊前学校","无锡市钱桥中学","无锡市洛社镇双庙初级中学","无锡市洛社初级中学","无锡市港下中学","无锡市张泾中学","无锡市甘露学校","无锡市厚桥中学","无锡市安镇中学","无锡市查桥中学","无锡市仓下中学"},
                new string[] {"无锡市陆区镇杨家村小学","无锡市陆区中心小学","无锡市阳山中心小学","无锡市藕塘镇稍塘小学","无锡市藕塘中心小学","无锡市钱桥镇西漳小学","无锡市石塘湾贝沙桥小学","无锡市石塘湾陡门小学","无锡市石塘湾中心小学","无锡市洛社镇花渡小学","无锡市洛社镇华圻小学","无锡市洛社镇雅西小学","无锡市洛社中心小学","无锡市玉祁镇中心小学蓉南分校","无锡市玉祁镇中心小学曙光分校","无锡市玉祁镇中心小学民主分校","无锡市玉祁中心小学","无锡市前洲中心小学西塘分校","无锡市前洲镇浮舟小学","无锡市前洲镇杨家圩小学","无锡市前洲中心小学","无锡市惠山区堰桥镇西漳塘头小学","无锡市惠山区堰桥镇西漳寺头小学","无锡市天一实验小学","无锡市堰桥镇刘巷小学","无锡市堰桥镇村前小学","无锡市堰桥实验小学","无锡市惠山小学","无锡市玉祁中学","无锡市前洲综合高级中学","无锡市堰桥中学","江苏省锡山高级中学","无锡市天一实验学校","无锡市洛社高级中学","无锡市安阳中学","无锡市藕塘中学","无锡市石塘湾中学","无锡市前洲初级中学","无锡市长安中学","江苏省天一中学","无锡市洛社新开河实验学校"},
                new string[] {"无锡市江南实验小学","无锡市滨湖中心小学","无锡市雪浪中心小学","无锡市梅园小学","无锡南洋国际学校","无锡市胡埭中学","无锡市梅梁中学","无锡市哈尔佛女子中学","江苏省太湖高级中学","无锡市华庄中学","无锡市滨湖中学","无锡市雪浪中学","无锡市东绛实验学校","无锡市格致中学"},
                new string[] {"江阴市澄江镇大桥小学","江阴市花园实验小学","江阴市澄江镇虹桥小学","阴市澄江镇环南路小学","江阴市辅延中心小学","江阴市城中实验小学","江阴市澄江中心小学","江阴市要塞实验小学","江阴市晨光实验学校","江阴市西郊实验小学","江阴市文林中心小学","江阴市祝塘中心小学","江阴市北国中心小学","江阴市顾山实验小学","江阴市河塘中心小学","江阴市新桥中心小学","江阴市周庄实验小学","江阴市南闸中心小学","江阴市云亭实验小学","江阴市桐岐中心小学","江阴市申港中心小学","江阴市西石桥中心小学","江阴市利港中心小学","江阴市璜土实验小学","江阴市第三实验小学","江阴市山观实验小学","江阴市长山中心小学","江阴市天华艺校","江阴市第二实验小学","江阴市祝塘中学","江阴市北国中学","江阴市顾山中学","江阴市长泾中学","江阴市云亭中学","江阴市月城中学","江阴市申港中学","江阴市澄西中学","江阴市璜土中学","江阴市山观中学","江阴市要塞中学","江阴市征存中学","江阴市第二中学","江苏省江阴市第一中学","江苏省江阴高级中学","江阴市成化高级中学","江阴市华士高级中学","江阴市青阳中学","江苏省南菁高级中学","江阴市文林中学","江阴市河塘中学","江阴市新桥中学","江阴市长寿中学","江阴市周西中学","江阴市周庄中学","江阴市瓠岱初级中学","江阴市马桥初级中学","江阴市陆桥中学","江阴市华士实验学校初中部","江阴市峭岐中学","江阴市璜塘实验学校初中部","江阴市徐霞客中学","江阴市青阳第二中学","江阴市桐岐中学","江阴市夏港中学","江阴市利港中学","江阴市石庄中学","江阴市体育学校","江阴市暨阳中学"},
                new string[] {"宜兴市新庄小学","宜兴市湖父镇小涧小学","宜兴市湖父小学","宜兴市大浦镇施荡小学","宜兴市张泽小学","宜兴市丁蜀镇尹家小学","宜兴市丁蜀镇定溪小学","宜兴市丁蜀镇周墅小学","宜兴市丁蜀镇蒋立小学","宜兴市丁蜀镇汤渡小学","宜兴市丁蜀镇民主路小学","宜兴市丁蜀镇公园路小学","宜兴市丁蜀镇陶都小学","宜兴市丁蜀镇东坡小学","江苏省宜兴市丁山小学","江苏省宜兴市芳桥实验小学","宜兴市万石小学","江苏省宜兴市悲鸿实验小学","江苏省宜兴市高塍实验小学","宜兴市和桥镇第二小学","江苏省宜兴市和桥实验小学","宜兴市芳庄小学","宜兴市新建小学","宜兴市杨巷小学","江苏省宜兴市官林实验小学","宜兴市太华镇桥涯小学","宜兴市太华镇华山小学","宜兴市太华小学","江苏省宜兴市徐舍实验小学","宜兴市鲸塘小学","宜兴市西渚镇桃园小学","宜兴市西渚小学","宜兴市张渚镇桃溪小学","宜兴市张渚镇东下小学","宜兴市张渚小学","江苏省宜兴市新街实验小学","宜兴市铜峰小学","宜兴市东域小学","江苏省宜兴市第二实验小学","江苏省宜兴市实验小学","宜兴市城东小学","宜兴市城西小学","宜兴市红塔小学","宜兴市陶城实验小学","宜兴市荆溪小学","宜兴市阳羡小学","宜兴市宜城镇福云小学","宜兴市宜城镇巷头小学","宜兴市城北小学","宜兴市新庄中学","宜兴市周铁中学","宜兴市徐舍中学","宜兴市铜峰中学","宜兴市丁蜀镇蠡墅中学","江苏省宜兴市丁蜀高级中学","江苏省宜兴市和桥高级中学","江苏省宜兴市官林中学","江苏省宜兴市张渚高级中学","宜兴市汇文中学","江苏省宜兴第一中学","江苏省宜兴中学","江苏省宜兴市东山高级中学","江苏省宜兴市阳羡高级中学","宜兴市湖父中学","江苏省宜兴市大浦中学","江苏省宜兴市张泽中学","宜兴市丁蜀画溪中学","宜兴市伏东中学","宜兴市川埠中学","江苏省宜兴市丁蜀镇陶都中学","宜兴市丁蜀镇东坡中学","宜兴市丁蜀镇第二中学","江苏省宜兴市培源中学","宜兴市洋溪中学","宜兴市分水中学","江苏省宜兴市万石中学","江苏省宜兴市屺亭中学","江苏省宜兴市高塍中学","宜兴市楝树中学","江苏省宜兴市和桥镇第二中学","宜兴市芳庄中学","宜兴市新建中学","宜兴市新芳中学","宜兴市凌霞实验中学","宜兴市丰义中学","江苏省宜兴市官林第二中学","宜兴市太华中学","宜兴市烟林中学","宜兴市西渚中学","江苏省宜兴市张渚实验学校","宜兴市张渚第二中学","江苏省宜兴市张渚桃溪中学","江苏省宜兴市高塍范道中学","宜兴市归径中学","宜兴市新街中学","宜兴市升溪中学","江苏省宜兴市实验中学","江苏省宜兴外国语学校","宜兴市红塔中学","宜兴市树人中学","江苏省宜兴市宜城中学"},
                new string[] {"苏州市金阊外国语实校","苏州市三元第三小学校","苏州市山塘中心小学","州市新庄小学","苏州市大德小学","苏州市彩香实验小学","州市金阊区实验小学校","苏州市第三十中学校"},
                new string[] {"苏州市南门路小学","苏州市草桥小学","苏州市杨枝小学校","苏州市沧浪区实验小学","苏州市第一中学校","江苏省苏州中学"},
                new string[] {"苏州市城东中心小学校","苏州市齐门小学","苏州市东中市实验小学校","苏州市平江实验学校分校","苏州市第四中学校","苏州市平江中学","苏州市平江实验校"},
                new string[] {"苏州市相城区望亭中心小学","苏州市相城区东桥中心小学","苏州市相城区黄埭中心小学","苏州市相城区黄桥实验小学","苏州市相城区阳澄湖中心小学","苏州市相城区湘城中心小学","苏州市相城区太平中心小学","苏州市相城区北桥中心小学","苏州市相城区渭塘实验小学","苏州市相城区蠡口实验小学","苏州市相城实验小学","苏州市相城区陆慕实验小学","苏州国际外语学校","苏州市相城区望亭中学","江苏省黄埭中学","苏州市相城区湘城中学","苏州市相城区太平中学","苏州市相城区渭塘中学","苏州市相城实验中学","苏州市相城区陆慕高级中学","苏州市相城区东桥中学","苏州市相城区春申中学","苏州市相城区黄桥中学","苏州市相城区阳澄湖中学","苏州市相城区北桥中学","苏州市相城区渭塘第二中学","苏州市相城区蠡口中学"},
                new string[] {"苏州市吴中区车坊前港小学","苏州市吴中区车坊金山小学","苏州市吴中区郭巷官浦小学","苏州市吴中区郭巷中心小学","甪直镇金澄湖小学","甪直镇第三小学","苏州叶圣陶实验小学","苏州市吴中区渡村中心小学","苏州市吴中区浦庄中心小学","吴中区横泾中心小学","西山镇堂里小学","西山镇石公小学","苏州市吴中区西山中心小学","苏州市吴中区东山中心小学","苏州市吴中区东山镇渡桥小学","苏州市吴中区东山实验小学","苏州市吴中区胥口中心小学","苏州市吴中区东湖小学","苏州市吴中区越溪中心小学","苏州市吴中区碧波实验小学","吴中区吴中实验小学","苏州市吴中区长桥中心小学","苏州市吴中区光福下绞小学","苏州市吴中区光福迂里小学","州市吴中区光福中心小学","苏州市吴中区藏书实验小学","苏州市吴中区木渎第五小学","苏州市吴中区木渎第二小学","苏州市吴中区木渎实验小学","苏州市吴中区木渎中心小学","吴中区天虹双语小学","吴中区宝带实验小学","苏州市吴中区苏苑实验小学","江苏省吴中职业高级中学","苏州吴中区市振兴职业中学","吴中区甪直中学","苏州市吴中区东山中学","苏州蓝缨学校","苏州市吴中区长桥中学","苏州瑞华双语学校","江苏省木渎高级中学天华学校","江苏省外国语学校","苏州市吴中区木渎第二高级中学","苏州市吴中区苏苑高级中学","苏州市振吴中学","苏州市吴中区郭巷中学","苏州市吴中区渡村中学","苏州市吴中区浦庄中学","苏州市吴中区横泾中学","苏州市吴中区石公中学","苏州吴中区胥口中学","苏州市吴中区碧波中学","苏州市吴中区光福中学","苏州市吴中区太湖实验学校","苏州市吴中区藏书中学","苏州市吴中区木渎实验中学","苏州市吴中区迎春中学","苏州市吴中区城西中学"},
                new string[] {"大义新明小学","大义中泾小学","大义东益小学","大义小学","常熟市实验小学分校","谢桥毛桥小学","谢桥小学","常熟市虞山镇言里小学","常熟市虞山镇安定小学","常熟市莫城中心小学","园区小学","常熟市星城小学","常熟市红枫小学","常熟市新区小学","常熟市昆承小学","江苏省常熟市花溪小学","虞园小学","常熟市琴湖小学","常熟市元和小学","五爱小学","常熟市商城小学","常熟市颜港小学","常熟市塔前小学","常熟市义庄小学","常熟市报本小学","常熟市报慈小学","常熟市石梅小学","常熟市实验小学","常熟市兴福中心小学","常熟市福山中心小学","常熟市海虞中心小学","常熟市梅李中心小学","常熟市东张中心小学","常熟市吴市中心小学","常熟市碧溪中心小学","常熟市浒浦中心小学","常熟市冶塘中心小学","常熟市张桥中心小学","常熟市练塘中心小学","常熟市董浜中心小学","常熟市支塘镇任阳中心小学","常熟市古里中心小学","沙家浜中心小学","常熟市大义中学","常熟市第八中学常熟市中学分校","外国语学校","梅李中学","常熟市浒浦中学","练塘中学","常熟市尚湖高级中学","常熟市中学","江苏省常熟中学","常熟市谢桥中学","常熟市昆承中学","常熟市兴隆中学","常熟市藕渠中学","常熟市第七中学","孝友中学","常熟市实验中学","常熟市第一中学","常熟市福山中学","常熟市王庄中学","海虞中学","常熟市珍门中学","常熟市周行学校","常熟市淼泉中学","赵市中学","常熟市东张中学","常熟市吴市中学","常熟市碧溪中学","辛庄中学","杨园中学","常熟市冶塘中学","常熟市张桥中学","徐市中学","常熟市董浜中学","常熟市何市中学","常熟市白茆中学","常熟市任阳中学","常熟市古里中学","常熟市沙家浜中学","常熟市唐市中学"},
                new string[] {"张家港市万红小学","张家港市云盘小学","张家港市实验小学","张家港市东莱小学","张家港市乘航小学","张家港市泗港小学","张家港市塘市小学","张家港市梁丰小学","张家港市沙洲小学","张家港市暨阳实验小学","张家港市南沙小学","张家港市港区小学","张家港市中兴小学","张家港市金港中心小学","张家港市后塍小学","张家港市德积小学","张家港市大新中心小学","张家港市合兴小学","张家港市锦丰中心小学","张家港市三兴小学","张家港市乐余中心小学","张家港市兆丰小学","张家港市南丰镇永联小学","张家港市南丰镇中心小学","张家港市鹿苑小学","张家港市妙桥小学","张家港市塘桥中心小学","张家港市西张小学","张家港市凤凰小学","张家港市外国语学校","张家港市常青藤实验中学","江苏省梁丰高级中学","张家港市暨阳高级中学","张家港高级中学","张家港市后塍高级中学","张家港市沙洲中学","张家港市乐余高级中学","张家港市塘桥高级中学","张家港市梁丰实验学校","张家港市第一中学","张家港市常阴沙学校初中部","张家港市第八中学","张家港市第七中学","张家港市第六中学","张家港市第五中学","张家港市第二中学","张家港市晨阳学校","张家港市南沙中学","张家港市港区初级中学","张家港市双山学校","江苏省张家港市新塍初级中学","张家港市大新中学","张家港市合兴初级中学","张家港市锦丰初级中学","张家港市三兴初级中学","张家港市第三中学","张家港市崇实初级中学","张家港市东沙学校","张家港市兆丰初级中学","张家港市南丰中学","张家港市鹿苑中学","张家港市妙桥中学","张家港市塘桥初级中学","张家港市凤凰中学","张家港市港口学校初中"},
                new string[] {"太仓市新区第二小学","太仓市沪太外国语小学","太仓市朱棣文小学","太仓市明德小学","太仓市浮桥中心小学","太仓市沙溪镇第三小学","太仓市沙溪镇第二小学","太仓市沙溪镇第一小学","太仓市双凤中心小学","太仓市陆渡中心小学","江苏省太仓市城厢镇第四小学","太仓市城厢镇第三小学","太仓市城厢镇第一小学","太仓市经贸小学","太仓市实验小学","太仓市实验高级中学","太仓市明德高级中学","江苏省沙溪高级中学","太仓市新区中学","太仓市实验中学","太仓市浏河镇新塘学校","太仓市明德初级中学","江苏省太仓市浮桥镇浏家港中学","太仓市浮桥镇金浪中学","太仓市浮桥中学","江苏省太仓市荣文学校","太仓市沙溪镇岳王学校","太仓市沙溪镇归庄中学","太仓市沙溪实验中学","太仓市双凤中学","太仓市城厢镇南郊中学","太仓市体育中学","太仓市第二中学"},
                new string[] {"昆山市南港中心小学校","昆山市周庄中心小学校","江苏省昆山市锦溪中心小学","江苏省昆山市大市中心小学","江苏省昆山市张浦中心小学校","昆山市淀山湖中心小学校","昆山市石浦中心小学","昆山市千灯中心小学校","江苏省昆山市花桥中心小学","昆山市陆家中心小学校","昆山市正仪中心小学校","昆山市石牌中心小学校","昆山市陆杨中心小学校","昆山市巴城中心小学校","昆山市新镇中心小学校","昆山市裕元实验学校","江苏省昆山市周市中心小学","昆山市玉山镇小河岸完全小学校","昆山市玉山镇姜巷小学","昆山市玉山镇南星渎小学","昆山市城北高科园中心小学","昆山市城北中心小学校","昆山市玉山镇赵厍小学","昆山市玉山镇共青小学","昆山市玉山镇朝阳小学","昆山市玉山镇西塘街小学","昆山市玉山镇司徒街小学","昆山市培本实验小学","昆山市玉山镇第一中心小学","江苏省昆山市蓬朗双林小学","江苏省昆山市蓬朗中心小学","昆山开发区中华园小学","昆山市玉山镇第三中心小学校","昆山经济技术开发区实验小学","昆山市柏庐实验小学","昆山市实验小学"},
                new string[] {"吴江市铜罗中心小学","吴江市青云中心小学","吴江市桃源镇中心小学","吴江市庙港实验小学","吴江市七都镇中心小学","吴江市八都中心小学","吴江市震泽镇实验小学","吴江市南麻中心小学","吴江市盛泽镇第二中心小学","吴江市盛泽镇中心小学","吴江市梅堰实验小学","吴江市平望镇实验小学","吴江市屯村实验小学","吴江市同里镇中心小学","吴江市黎里中心小学","吴江市金家坝中心小学","吴江市芦墟第二中心小学","吴江市芦墟镇实验小学","吴江经济开发区长安花苑小学","吴江经济开发区天和小学","吴江市松陵镇第三中心小学","吴江市松陵镇第二中心小学","吴江市松陵镇中心小学","吴江市实验小学","苏州枫华高级中学","吴江市青云中学","苏州枫华中学","江苏省震泽中学","吴江市盛泽中学","吴江市黎里中学","吴江市芦墟中学","吴江市高级中学","吴江市中学","吴江市铜罗中学","吴江市桃源中学","吴江市庙港中学","吴江市七都中学","吴江市八都中学","吴江市震泽第一中学","吴江市盛泽第三中学","吴江市盛泽第二中学","吴江市盛泽第一中学","吴江市菀坪学校","吴江市横扇中学","吴江市梅堰中学","吴江市平望二中","吴江市同里初级中学","吴江市同里中学","吴江市北厍中学","吴江市黎里第二中学","吴江市芦墟第一中学","吴江市芦墟第二中学","吴江市金家坝中学","吴江经济开发区实验初级中学","吴江市鲈乡九年制实验学校","吴江市实验初级中学","吴江市松陵镇第三中学","吴江市松陵第一中学"},
                new string[] {"苏州市虎丘区实验小学","苏州市横塘中心小学校","苏州市虎丘第二中心小学校","苏州市虎丘第一中心小学校","苏州市虎丘实验学校","高新区虎丘区东渚中学"},
                new string[] {"文华小学","雁滨小学","八一小学","钟秀小学","观河中学","八一中学"},
                new string[] {"南通市费桥小学校","南通市沿河桥小学校","南通市吴桥小学校","南通市鹤涛小学校","南通市陈桥小学校","南通市五里树小学校","南通市五接桥小学校","南通市港闸区实验小学"},
                new string[] {"通州市金通小学幼儿院","通州小学","通州市实验小学","江苏省通州职业高级中学","通州市姜灶中学","通州市兴仁中学","江苏省平潮高级中学","通州市刘桥中学","通州市二爻中学","通州市三余中学","通州市二甲中学","江苏省西亭高级中学","通州市金沙中学","江苏省通州高级中学","通州市石港中学","通州市文山初级中学","通州市先锋初级中学","通州市正场初级中学","通州市姜灶初级中学","通州市南兴初级中学","通州市川港中学","通州市新联中学","通州市英雄初级中学","通州市刘桥初级中学","通州市赵甸初级中学","通州市平东初级中学","通州市五接中学","通州市兴东初级中学","通州市兴仁横港学校中学部","通州市兴仁初级中学","通州市五总初级中学","通州市骑岸初级中学","通州市四安中学","通州市石南初级中学","通州市五窑初级中学","通州市石港初级中学","通州市五甲初级中学","通州市十总中学","通州市海晏中学","通州市恒兴初级中学","通州市北兴桥初级中学","通州市忠义初级中学","通州市重三初级中学","通州市杨港初级中学","通州市东社中学","通州市袁灶初级中学","通州市余北初级中学","通州市海洪初级中学","通州市纱场初级中学","通州市西亭初级中学","通州市金余初级中学","通州市金北学校","通州市金西初级中学","通州市金郊初级初中","通州市少儿业余体育学校"},
                new string[] {"如皋市搬经镇夏堡小学","如皋市搬经镇加力小学","如皋市搬经镇搬经小学","如皋市如城镇范庄小学","如皋市如城镇老南小学","如皋市如城镇大明小学","如皋市如城镇庆余小学","如皋市如城镇庆丰小学","如皋市如城镇邵庄小学","如皋市如城镇邓元小学","如皋市如城镇城西小学","如皋市如城镇许庄小学","如皋市如城镇城东小学","如皋市如城镇凌志小学","如皋市如城镇北郊小学","如皋市如城镇新民小学","如皋市如城镇陆桥小学","如皋市如城镇健康小学","如皋市如城镇安定小学","江苏省如皋师范学校附属小学","江苏省如皋第一职业高级中学","如皋市二案中学","如皋市丁堰中学","江苏省白蒲高级中学","如皋市薛窑中学","如皋市石庄中学","如皋市江安中学","如皋市搬经中学","如皋市磨头中学","如皋市城西中学","如皋市第一中学","江苏省如皋中学","如皋市袁桥镇第二初级中学","如皋市袁桥镇初级中学","如皋市桃园镇桃园初级中学","如皋市磨头镇场北初级中学","如皋市磨头镇场南初级中学","如皋市磨头镇磨头初级中学","如皋市搬经镇夏堡初中","如皋市搬经镇加力初中","如皋市搬经镇初级中学","如皋市常青镇初级中学","如皋市高明镇东燕初中","如皋市高明镇高明初级中学","如皋市江安镇黄市初级中学","如皋市江安镇葛市初级中学","如皋市江安镇滨江初级中学","如皋市吴窑镇金盛初中","如皋市吴窑镇中心学校","如皋市长江镇江防初级中学","如皋市石庄镇石北初级中学","如皋市石庄镇初级中学","如皋市郭园镇郭园初级中学","如皋市九华镇龙舌初级中学","如皋市九华镇九华初级中学","如皋市下原镇白雁学校","如皋市下原镇下原镇初级中学","江苏省如皋市林梓镇奚斜学校","江苏省如皋市林梓镇林梓初级中学","如皋市白蒲镇勇敢学校","如皋市白蒲镇新姚初级中学","如皋市白蒲镇初级中学","如皋市丁堰镇初级中学","江苏省如皋市东陈镇东陈初级中学","如皋市雪岸镇雪岸初级中学","如皋市柴湾镇柴湾初级中学","如皋市柴湾镇戴庄初级中学","如皋市如城镇大明初级中学","如皋市如城镇邓元初级中学","如皋市如城镇许庄初级中学","如皋市如城镇新民初级中学","如皋市如城镇第三中学","如皋初级中学","如皋博爱双语学校","如皋市惠如文化艺术学校","如皋市实验初中","如皋市育贤双语学校"},
                new string[] {"江苏南通海门东灶港中心小学","海洪中心校","刘浩中心小学","江苏省南通海门市包场镇中心小学","海门市正余中心小学","海门市余东中心小学","江苏省南通市海门市王浩中心小学","海门市树勋中心小学","海门市货隆中心小学","海门市国强中心小学","海门市四甲中心小学","海门市临江中心小学","海门市三阳中心小学","海门市万年中心小学","海门市六匡中心小学","海门市悦来中心小学","海门市麒麟中心小学","海门市汤家中心小学","海门市三厂镇中心小学","海门市平山中心小学","海门市常乐中心小学","海门市海门镇中心小学","海门市瑞祥中心小学","海门市德胜中心小学","海门市三和中心小学","海门市天补中心小学","海门市三星中心小学","海门市海南小学","海门市通源小学","海门市东洲小学","海门市育才小学","江苏省海门师范附属小学","海门市实验小学","沛县张寨镇中心小学","海门实验学校","江苏省包场高级中学","四甲中学","江苏省海门中学","南通市冠今中学","悦来中学","海门市麒麟中学","海门市三厂中学","海门市天补中学","昌邑市北孟镇第二中学","江苏南通海门东灶港初级中学","海洪初中","海门市六甲初级中学","海门市包场初级中学","海门市正余初级中学","海门市余东中学","海门市王浩初级中学","海门市树勋初级中学","海门市货隆初级中学","海门市国强初级中学","海门市四甲镇初级中学","海门市临江初级中学","海门市三阳初级中学","海门市万年初级中学","海门市六匡初级中学","海门市悦来镇初级中学","海门市海永学校","海门市汤家初级中学","海门市三厂镇初级中学","海门市长兴中学","海门市常乐初级中学","海门市江心沙学校","海门市秀山初中","海门市城北初级中学","海门市瑞祥初级中学","海门市德胜初级中学","海门市三和中学","海门市天补镇初级中学","海门市三星初级中学","江苏省海门中学附属学校","海门市业余体育学校","海门市海南中学","海门市东洲中学","河口镇孟庄中学"},
                new string[] {"启东市吕四港镇秦潭港中心小学","启东市吕四港镇茅家港中心小学","启东市天汾镇中心小学","启东市海复镇中心小学","启东市东元中心小学","启东市近海镇中心小学","启东市向阳镇中心小学","启东市少直镇聚阳中心校","启东市少直中心校","启东市新安镇中心小学","启东市惠萍中心小学","启东市和合镇希士中心小学","启东市和合镇中心小学","启东市寅阳镇中心小学","东海镇中心小学","启东市合作镇新义中心小学","启东市合作镇中心小学","启东市志良中心小学","启东市王鲍镇聚南中心小学","启东市王鲍镇中心小学","启东市久隆镇新港中心小学","启东市久隆镇中心小学","启东市北新镇决心中心小学","启东市北新镇中心小学","启东市民主镇万安中心小学","启东市民主镇中心小学","南阳镇永和中心小学","南阳镇中心小学","启东市大兴镇惠和中心小学","启东市大兴镇中心小学","启东市惠丰镇中心小学","启东市汇龙镇永阳中心小学","启东市汇龙镇圩角中心小学","南苑小学","江苏省启东实验小学","启东市东安中学","启东市汇龙中学","江苏省启东中学","启东市建新中学","启东市东海中学","启东市江海中学","启东市吕四中学","启东市东南中学","启东市大江中学","诸城市程戈庄初中南校","启东市陈兆民中学","启东市吕四港镇鹤城初级中学","天汾镇初级中学","海复初级中学","启东市东元初级中学","启东市近海镇初级中学","启东市向阳中学","启东市常胜初级中学","启东市新安镇初级中学","启东市惠萍镇初级中学","启东市寅阳初级中学","启东市东海镇初中","启东市合作初级中学","启东市竖河初级中学","启东市国本中学","启东市聚星中学","启东市启隆乡学校","启东市继述中学","启东市北新镇初级中学","启东市民主镇初级中学","启东市南阳中学","启东市永和中学","启东市大兴镇初级中学","启东市惠丰初级中学","启东市永阳初级中学","启东市圩角初级中学","启东市城西中学","启东市新港中学","启东市南苑中学","启东市长江中学"},
                new string[] {"海安县李堡镇陈庄小学","海安县墩头镇中心小学","海安县白甸镇中心小学","海安县南莫镇中心小学","海安县孙庄镇中心小学","江苏省南通市海安县雅周镇中心小学","海安县曲塘镇中心小学","海安县胡集镇第二中心小学","海安县胡集镇中心小学","江苏南通海安县海安镇隆政小学","江苏南通海安县海安镇通学桥小学","江苏南通海安县海安镇海南小学","江苏南通海安县海安镇田庄小学","江苏南通海安县海安镇海北小学","江苏南通海安县海安镇丹凤小学","江苏南通海安县教师进修附属小学","江苏南通海安县明道小学","海安县大公镇中心小学","海安县西场镇中心小学","海安县李堡镇中心小学","海安县角斜镇中心小学","海安县老坝港中心小学","海安县海陵小学","海安县大公中学","海安县立发中学","海安县墩头中学","海安县南莫中学","海安县胡集中学","海安县孙庄中学","海安县实验中学","海安县西场中学","海安县李堡中学","海安县曲塘中学","江苏省海安高级中学","江苏省海安高级中学","海安县墩头镇吉庆初级中学","海安县墩头镇仇湖初级中学","海安县墩头镇双溪初级中学","海安县白甸镇白甸初级中学","海安县白甸镇瓦甸初级中学","海安县南莫镇邓庄初级中学","海安县南莫镇沙岗初级中学","海安县孙庄镇仁桥初级中学","江苏省南通市海安县雅周镇张垛初级中学","江苏省南通市海安县雅周镇初级中学","海安县曲塘镇章郭初中","海安县曲塘镇双楼初级中学","海安县曲塘中学附属初级中学","海安县胡集镇青萍初级中学","江苏南通海安县海安镇隆政初中","江苏南通海安县海安镇海北初级中学","海安县海安镇江苏教院附属海安初级中学","海安县城东镇新生初级中学","海安县城东镇韩洋初级中学","海安县城东镇南屏初级中学","海安农场学校","海安县大公镇古贲初级中学","海安县大公镇北凌初级中学","海安县西场镇壮志初级中学","海安县西场镇初级中学","海安县李堡镇丁所初级中学","海安县李堡镇初级中学","海安县角斜镇初级中学","海安县老坝港镇初级中学","海安县紫石中学","海安县海陵中学","海安县少年儿童体育学校","海安县迮庄中学","海安县城南中学"},
                new string[] {"如东县掘港小学","如东县实验小学","如东县晓塘小学","如东县掘港双语小学","如东县马塘小学","如东县马塘中学","如东县岔河中学","如东县丰利中学","如东县苴镇中学","如东县兵房中学","江苏省如东县双甸高级中学","江苏省栟茶高级中学","江苏省栟茶高级中学","如东县掘港中学","江苏省如东高级中学","江苏省如东高级中学","如东县曹埠镇初级中学","如东县马塘镇邱陞中学","如东县马塘镇新潮初级中学","如东县马塘镇桐本初级中学","如东县新店初级中学","如东县双甸镇石甸初中","如东县双甸镇双南初级中学","如东县双甸镇初级中学","如东县岔河镇古坝初级中学","如东县岔河镇岔北初级中学","如东县岔河镇岔南初级中学","如东县袁庄镇先民初级中学","如东县袁庄镇袁庄初级中学","如东县河口镇景安初级中学","如东县河口镇中天中学","如东县河口镇直夫初级中学","如东县栟茶镇浒零初级中学","如东县栟茶镇靖海初级中学","如东县洋口镇光荣初级中学","如东县港口中学","如东县洋口镇初级中学","如东县苴镇新光初级中学","如东县丰利镇环港初级中学","如东县丰利镇四明初中","如东县丰利镇初级中学","如东县大豫镇初级中学","如东县兵房镇巩王初级中学","如东县兵房镇初级中学","如东县掘港天一学校","如东县掘港农场中学","如东县掘港镇华丰初级中学","如东县掘港镇童店初级中学","如东县掘港镇苏云初级中学","如东县掘港镇九总初级中学","如东县掘港镇第一初级中学","如东县茗海中学","如东县实验中学"}
 //未完，接下来从扬州的开始             
            };
            String countyName = cmbCounty.SelectedItem.ToString();
            switch (countyName)
            {
                case "玄武区":
                    {
                        cmbSchoolName.DataSource = schoolStr[0]; 
                    }
                    break;
                case "鼓楼区":
                    {
                        cmbSchoolName.DataSource = schoolStr[1];
                    }
                    break;
                case "建邺区":
                    {
                        cmbSchoolName.DataSource = schoolStr[2];
                    }
                    break;
                case "白下区":
                    {
                        cmbSchoolName.DataSource = schoolStr[3];
                    }
                    break;
                case "秦淮区":
                    {
                        cmbSchoolName.DataSource = schoolStr[4];
                    }
                    break;
                case "下关区":
                    {
                        cmbSchoolName.DataSource = schoolStr[5];
                    }
                    break;
                case "雨花台区":
                    {
                        cmbSchoolName.DataSource = schoolStr[6];
                    }
                    break;
                case "浦口区":
                    {
                        cmbSchoolName.DataSource = schoolStr[7];
                    }
                    break;
                case "栖霞区":
                    {
                        cmbSchoolName.DataSource = schoolStr[8];
                    }
                    break;
                case "江宁区":
                    {
                        cmbSchoolName.DataSource = schoolStr[9];
                    }
                    break;
                case "六合区":
                    {
                        cmbSchoolName.DataSource = schoolStr[10];
                    }
                    break;
                case "溧水县":
                    {
                        cmbSchoolName.DataSource = schoolStr[11];
                    }
                    break;
                case "高淳县":
                    {
                        cmbSchoolName.DataSource = schoolStr[12];
                    }
                    break;
                case "京口区":
                    {
                        cmbSchoolName.DataSource = schoolStr[13];
                    }
                    break;
                case "润州区":
                    {
                        cmbSchoolName.DataSource = schoolStr[14];
                    }
                    break;
                case "丹徒区":
                    {
                        cmbSchoolName.DataSource = schoolStr[15];
                    }
                    break;
                case "丹阳市":
                    {
                        cmbSchoolName.DataSource = schoolStr[16];
                    }
                    break;
                case "扬中市":
                    {
                        cmbSchoolName.DataSource = schoolStr[17];
                    }
                    break;
                case "句容市":
                    {
                        cmbSchoolName.DataSource = schoolStr[18];
                    }
                    break;
                case "钟楼区":
                    {
                        cmbSchoolName.DataSource = schoolStr[19];
                    }
                    break;
                case "天宁区":
                    {
                        cmbSchoolName.DataSource = schoolStr[20];
                    }
                    break;
                case "戚墅堰区":
                    {
                        cmbSchoolName.DataSource = schoolStr[21];
                    }
                    break;
                case "新北区":
                    {
                        cmbSchoolName.DataSource = schoolStr[22];
                    }
                    break;
                case "武进区":
                    {
                        cmbSchoolName.DataSource = schoolStr[23];
                    }
                    break;
                case "金坛市":
                    {
                        cmbSchoolName.DataSource = schoolStr[24];
                    }
                    break;
                case "溧阳市":
                    {
                        cmbSchoolName.DataSource = schoolStr[25];
                    }
                    break;
                case "北塘区":
                    {
                        cmbSchoolName.DataSource = schoolStr[26];
                    }
                    break;
                case "南长区":
                    {
                        cmbSchoolName.DataSource = schoolStr[27];
                    }
                    break;
                case "锡山区":
                    {
                        cmbSchoolName.DataSource = schoolStr[28];
                    }
                    break;
                case "惠山区":
                    {
                        cmbSchoolName.DataSource = schoolStr[29];
                    }
                    break;
                case "滨湖区":
                    {
                        cmbSchoolName.DataSource = schoolStr[30];
                    }
                    break;
                case "江阴市":
                    {
                        cmbSchoolName.DataSource = schoolStr[31];
                    }
                    break;
                case "宜兴市":
                    {
                        cmbSchoolName.DataSource = schoolStr[32];
                    }
                    break;
                case "金阊区":
                    {
                        cmbSchoolName.DataSource = schoolStr[33];
                    }
                    break;
                case "沧浪区":
                    {
                        cmbSchoolName.DataSource = schoolStr[34];
                    }
                    break;
                case "平江区":
                    {
                        cmbSchoolName.DataSource = schoolStr[35];
                    }
                    break;
                case "相城区":
                    {
                        cmbSchoolName.DataSource = schoolStr[36];
                    }
                    break;
                case "吴中区":
                    {
                        cmbSchoolName.DataSource = schoolStr[37];
                    }
                    break;
                case "常熟市":
                    {
                        cmbSchoolName.DataSource = schoolStr[38];
                    }
                    break;
                case "张家港市":
                    {
                        cmbSchoolName.DataSource = schoolStr[39];
                    }
                    break;
                case "太仓市":
                    {
                        cmbSchoolName.DataSource = schoolStr[40];
                    }
                    break;
                case "昆山市":
                    {
                        cmbSchoolName.DataSource = schoolStr[41];
                    }
                    break;
                case "吴江市":
                    {
                        cmbSchoolName.DataSource = schoolStr[42];
                    }
                    break;
                case "苏州工业园区":
                    {
                        cmbSchoolName.DataSource = schoolStr[43];
                    }
                    break;
                case "崇川区":
                    {
                        cmbSchoolName.DataSource = schoolStr[44];
                    }
                    break;
                case "港闸区":
                    {
                        cmbSchoolName.DataSource = schoolStr[45];
                    }
                    break;
                case "通州市":
                    {
                        cmbSchoolName.DataSource = schoolStr[46];
                    }
                    break;
                case "如皋市":
                    {
                        cmbSchoolName.DataSource = schoolStr[47];
                    }
                    break;
                case "海门市":
                    {
                        cmbSchoolName.DataSource = schoolStr[48];
                    }
                    break;
                case "启东市":
                    {
                        cmbSchoolName.DataSource = schoolStr[49];
                    }
                    break;
                case "海安县":
                    {
                        cmbSchoolName.DataSource = schoolStr[50];
                    }
                    break;
                case "如东县":
                    {
                        cmbSchoolName.DataSource = schoolStr[51];
                    }
                    break;
              

            }
        }
    }
}
